{
  "roles": [
    {
      "title": "AI-Driven Product Design",
      "subtitle": "Crafting seamless, intelligent experiences",
      "description": "Designing intuitive, ethical, and scalable AI-powered experiences that enhance automation, decision-making, and human-AI interaction."
    },
    {
      "title": "Scalable UX & Design Systems",
      "subtitle": "Bringing structure and consistency to design",
      "description": "Building and maintaining structured design systems that ensure consistency, efficiency, and seamless collaboration between design and engineering."
    },
    {
      "title": "Strategy & Research",
      "subtitle": "Balancing user needs, business goals, and technical feasibility.",
      "description": "Aligning user needs, business goals, and technical feasibility through UX strategy, research, and data-driven insights to create impactful experiences."
    },
    {
      "title": "Full Stack Web Development",
      "subtitle": "Bridging design and development with a strong technical foundation",
      "description": "Bridging design and development by collaborating with engineers, applying front-end knowledge, and ensuring scalable, high-performance UI execution."
    }
  ],
  "process": [
    {
      "step": "Step 1",
      "title": "Research",
      "description": "Discovering and understanding the problem space and learning about the user. Bonus: I can use data analytics to gain insights from datasets."
    },
    {
      "step": "Step 2",
      "title": "Principles & Strategy",
      "description": "Creating design principles to help guide the project and UX decisions. Ensures alignment across the team."
    },
    {
      "step": "Step 3",
      "title": "User Journey",
      "description": "Diving deep into user journey, user stories, and user decision making."
    },
    {
      "step": "Step 4",
      "title": "Exploration",
      "description": "Exploring a wide range of possible solutions. Testing, iterating, discussing and working through the problem."
    },
    {
      "step": "Step 5",
      "title": "Refinement",
      "description": "Refining a chosen solution, polishing until it’s ready for handover to the developers. Documenting design decisions."
    },
    {
      "step": "Step 6",
      "title": "Handover",
      "description": "Working closely with the dev team to ensure a successful handover and implementation process. I can be an extra pair of hands for front-end implementation."
    },
    {
      "step": "Step 7",
      "title": "Supporting",
      "description": "Keep monitoring implementation process, in case improvements need to be made."
    }
  ],
  "values": [
    {
      "title": "Making a Positive Impact",
      "description": "I believe in creating designs and products that make a positive difference in the world. Every decision I make aims to create meaningful, accessible, and inclusive experiences."
    },
    {
      "title": "Curiosity & Iteration",
      "description": "I approach design with an experimentation mindset, asking myself 'What if?', and continuously testing and iterating to learn faster and drive innovation. I value data-driven decisions to solve complex user challenges."
    },
    {
      "title": "Collaboration & Versatility",
      "description": "I thrive in collaborative environments—whether it’s working with centralised design teams or cross-functional teams. My experience across various industries, including education, SaaS, and emerging tech, helps me bring a well-rounded perspective to every project."
    },
    {
      "title": "Attention to Detail",
      "description": "Great design is in the details. I’m meticulous about ensuring that every element works harmoniously, whether it’s pixel-perfect UI, clean code, or a smooth user flow."
    },
    {
      "title": "Balancing Creativity & Logic",
      "description": "I believe great solutions emerge when creativity meets logic. I love blending imaginative ideas with a solid technical foundation to create designs that are not only beautiful but also functional and scalable."
    },
    {
      "title": "Lifelong Learning",
      "description": "I’m always curious and eager to learn. Whether it’s a new design approach, a coding framework, or an analytics tool, I embrace continuous learning to stay ahead and improve my craft."
    }
  ]
}
