[
  {
    "id": 1,
    "projectImage": "/images/portfolio/ritmo-cover.png",
    "headerImage": "/images/banner-images/ritmo-banner.png",
    "projectTitle": "Ritmo: Latin Dance Moves Library",
    "slug": "ritmo",
    "role": "UI/UX Designer & Developer",
    "date": "July 2024 - present",
    "overview": "Ritmo is an interactive app designed to help users learn and practice Latin dance moves through video tutorials and step-by-step guides, complementary to going to live classes.",
    "objectiveGoals": [
      "Create an engaging user interface",
      "Develop a centralised comprehensive dance move library that is easy to understand for different skill levels",
      "Facilitate easy navigation and search functionality",
      "Incorporate user feedback for continuous improvement",
      "Provide instructions for follower and leads dancers"
    ],
    "background": "During dance practicas or socials, I frequently encounter leads inquiring about particular moves they're trying to remember and recreate. As a dance instructor, it's essential for me to have access to this library either for guiding my students towards it or utilising it myself. This way, I can provide them with the correct move to reference if they wish to practice it independently.", 
    "backgroundImages": [
      "/images/product/ritmo-background.png"
    ],
    "designProcess": {
      "research": "As I am around dancers all the time, I conducted semi-informal interviews with a couple of students in the community as well as fellow instructors, who shared their experience with me. I distilled all the goals, needs, and painpoints with respective user personas, and mapped out possible user journey flow charts which inform possible features for MVP or MVP+.",
      "definingProblem": "Users struggle to find cohesive and organized resources for learning Latin dance moves. Something that came out quite frequently is that there are several different naming conventions, which can mean different moves depending where you are taught. Because the moves are often in Spanish, non-Spanish speakers either mishear the calls or can't remember them, which does not help when they are trying to look them up online.",
      "ideation": "Brainstormed various features like a video library, save functionality, search bars (and what exactly users can use to look up moves - in this case a descriptive search may be useful aside from keywords). Students and instructors tend to look up moves in class or practicas, so designing mobile-first is an essential approach for it's success.",
      "prototyping": "Developed wireframes and interactive prototypes using Figma, focusing on userflows, user personas and interface design. At this stage I am focusing on a minimal viable product, which includes the moves library and a profile where users can save their moves for future reference. I have designed the streaks and tracking for a Phase 2 implementation, depending how fast I get the developed.",
      "feedback": "So far I have shown the wireframes to a few students, who gave really good constructive feedback such as including rueda hand signals and providing several sources of video content to be able to view the move from different angles.",
      "designProcessImages": [
        {
          "path": "/images/product/ritmo-personas.png",
          "caption": "User personas for Beginner, Improvers, Intermediate/Advanced level and Instructors"
        },
        {
          "path": "/images/product/sofia-userjourney-ritmo.png",
          "caption": "User Journey flowchart for beginner student Sofia"
        },
        {
          "path": "/images/product/mark-userjourney-ritmo.png",
          "caption": "User Journey flowchart for Improvers student Mark"
        },
        {
          "path": "/images/product/javier-userjourney-ritmo.png",
          "caption": "User Journey flowchart for Intermediate/Advanced student Javier"
        },
        {
          "path": "/images/product/carla-userjourney-ritmo.png",
          "caption": "User Journey flowchart for dance instructor Carla"
        },
        {
          "path": "/images/product/ritmo-low-fi-wireframes.png",
          "caption": "The first three super low fidelity wireframes I created to visualise the main idea for the app - Search functionality to filter the move, dance-style focused page, and a dance-move focus page with all the details. I tend to start from very low-details to get the idea on the page to then gradually adding more and more details. This allows me to keep my focus on the must-have functionality, rather than creating a cluttered interface right of the bat."
        }
      ]
    },
    "solutionImplementation": {
      "designDecisions": "Prioritised a clean and intuitive UI to enhance user experience and accessibility. Kept functionality to an MVP state for now (the library, user profile and onboarding flow). Whilst the tracking features are really good to have, I found that for the main pain point that being able to look up, read about and save moves is more crucial than trying to track progress. However having features to intiate motivation into the students to keep practising and learning is definitely one of the main factors for long-term sucess of the app.",
      "accessibilityUsability": "Ensured compliance with WCAG guidelines for improved accessibility. So far this as been established with colour contrast checks, using ARIA labels when developing the app and creating a accessibility-friendly layout. The next step I want to incorporate might be a dark/light UI switch for those who struggle with astigmatism or similar. It would also be good to get the app tested with users who have accessibility needs to see whether the current implementation is actually working for those users.",
      "challengesFaced": "Overcame initial technical hurdles related to video streaming and user data management. I have to incorporate open-source links via Youtube to get video content currently, as there are lots of moves to cover. The tracking feature I'm currently looking into will require some research and upskilling in particular tech frameworks that can handle this task.",
      "designProductImages": [
        "/images/product/ritmo-technical-flowchart.png"
      ]
    },
    "lessonsLearned": {
      "designInsights": "User feedback is invaluable in the design process; iterate quickly based on real user needs. Was also great to learn about what students are looking for (and fellow instructors), as they tend to voice frustrations every now and then, but it's been helpful to channel those ideas into a possible solutions. Will continue gathering feedback each phase of rolling out changes.",
      "technicalInsights": "Investing in a solid backend architecture pays off during scaling and feature expansion. I learned that SQLite might be stretched with the amount of moves I might need to documents (for one style it's fine - approx. 200 moves), but any further upscalling may need a more rebust SQL database.",
      "improvements": "Future updates should focus on enhancing personalisation and supporting students on their own journeys - each student has a different background and a different reason to why they started dance classes. It's important to support those needs on a equity-based lens, rather than creating a universal solution that is trying to 'fit all' but may miss certain students."
    },
    "keyTakeaways": {
      "summary": "Ritmo so far successfully combines a straight-forward, simple design with robust functionality to create a valuable resource for Latin dance enthusiasts. However, as it is still in its infancy, there is still lots of potential and scope to explore that makes this app even more useful to the latin dance community.",
      "demonstrationSkills": "Showcased skills in UX design, full stack development, and user-centered research. Incorporating regular testing session with local students. Exploring dark UI design and improve auto-layout skills for mobile."
    },
    "finalImage": "/images/product/ritmo-final-banner.png",
    "githubLink": "https://github.com/corina-reitemeyer/ritmo-dance-library"
  },
  {
    "id": 2,
    "projectImage": "/images/portfolio/ow-templates.png",
    "headerImage": "/images/banner-images/ow-templates.png",
    "projectTitle": "Optimal Workshop Templates",
    "slug": "ow-templates",
    "company": "Optimal Workshop",
    "role": "Senior Product Designer",
    "date": "September 2022 - August 2023",
    "overview": "Optimal Workshop Templates is a collection of pre-built templates designed to streamline the user research and information architecture processes. The MVP product aims to educate users on best practices while accelerating setup times for both novice and experienced users of Optimal Workshop's tools.",
    "objectiveGoals": [
      "Create pre-built templates that demonstrate best practices in user research and information architecture.",
      "Enhance user learning by providing well-documented templates that guide users through effective techniques.",
      "Speed up the setup process for experienced users by offering customisable templates that reduce the need for manual configuration.",
      "Ensure templates are versatile and can be adapted to various project needs, from simple to complex."
    ],
    "background": "The Templates project was initiated to address the need for structured and educational resources within Optimal Workshop's suite of tools. The goal was to make it easier for users to apply best practices in their research and design workflows, thus improving overall efficiency and effectiveness. Additionally it addressed the initial 'blank screen' scenario, where less experienced users may find themselves in, unsure where to start especially if they had a specific research outcome in mind.",
    "designProcess": {
      "research": "Conducted user interviews and surveys to identify common challenges and needs in user research and information architecture. Analysed existing tools and templates for gaps and opportunities. Conducted competitor analysis to highlight gaps in the market.",
      "definingProblem": "Inexperienced users needed more guidance when setting up research projects, as they often found themselves unsure how to connect the tools with the results they were hoping to achieve. Experienced users needed a way to quickly start projects with structured templates that would also serve as educational tools to enable them to explore the tools in ways they may have not thought of. Often they would recommend certain tools and processes around it to the juniors in their teams. The challenge was to design templates that were both instructive and adaptable.",
      "ideation": "Brainstormed various template formats and structures. Considered including step-by-step guides, examples of best practices, and customisable elements for different use cases. Pre-filled fields inside the tools to allow users to get an impression of how they could shape their data.",
      "prototyping": "Developed initial prototypes of templates using design tools like Figma. Created an MVP, which we then A/B tested with a small user group.",
      "feedback": "Gathered feedback from both novice and experienced users after we rolled out the feature to more users to gain feedback. Identified areas for improvement, such as adding more detailed instructions and improving template flexibility.",
      "designProcessImages":[
        {
        "path": "/images/optional/PROJECT TEMPLATES - MVP.jpg",
        "caption": "This user journey shows the user interaction points where users would creating studies from - dashboard and studies tab. From here, the user can chose a template, which opens up a view with further information on how the template should be used and what it contains. "
        }
      ]
    },
    "solutionImplementation": {
      "designDecisions": "Focused on creating clear, structured templates with instructional content to guide users. Prioritised ease of use and adaptability in design decisions.",
      "testing": "Performed extensive usability testing with different user groups. Evaluated the effectiveness of templates in improving user understanding and setup efficiency.",
      "challengesFaced": "Faced challenges in balancing template complexity with ease of use. Had to iterate on design to meet diverse user needs while maintaining simplicity.",
      "designProductImages":[
        "/images/product/ow-hi-fi-wireframes 1.png",
        "/images/product/ow-hi-fi-wireframes 10.png",
        "/images/product/ow-hi-fi-wireframes 3.png"
      ]
    },
    "lessonsLearned": {
      "designInsights": "Learned the importance of clear documentation and user guidance within templates. Found that simplicity in design often leads to better user adoption and satisfaction. However it is important to remember, that this feature is only a piece in the bigger puzzle of customer onboarding and retention.",
      "technicalInsights": "Allowed me to further learn and analyse the exisiting tools in the product better. Gained experience in integrating templates with existing tools. Improved skills in creating adaptable, modular designs.",
      "improvements": "Future improvements could include more advanced customisation options and enhanced instructional content to further support users in learning best practices."
    },
    "keyTakeaways": {
      "summary": "The Optimal Workshop Templates project successfully created a set of pre-built templates that facilitate user research and information architecture while serving as educational tools. It highlighted the value of combining instructional content with practical tools. The next step involves expanding the range of use cases by introducing additional templates. This will provide users with pre-configured data across various areas of the tool, enhancing their ability to seamlessly integrate and transfer information between different tools.",
      "demonstrationSkills": "Demonstrated skills in product design, user research, and integration with existing tools. Showcased ability to design for both usability and instructional purposes."
    },
    "finalImage":"/images/product/ow-hi-fi-wireframes.png"
  }, 

    {
      "id": 3,
      "projectImage": "/images/portfolio/MoE-Design-System-Hero.png",
      "headerImage": "/images/banner-images/moe-design-system.png",
      "projectTitle": "Ministry of Education - Design System",
      "slug": "moe-design-system",
      "company": "Ministry of Education (New Zealand)",
      "role": "Senior UX/UI Designer",
      "date": "2020 - 2022",
      "overview": "The Ministry of Education Design System was developed to address the need for a consistent, accessible, and efficient design framework following the rapid creation of a website during the COVID-19 lockdown. This design system includes a comprehensive component library and design guidelines aimed at ensuring uniformity and adherence to accessibility standards across digital platforms.",
      "objectiveGoals": [
        "Create a unified design system to ensure consistency across web platforms for the Ministry of Education.",
        "Develop a component library that includes the most commonly used design elements, adhering to accessibility and usability standards.",
        "Provide clear design guidelines and documentation to support future development and maintenance.",
        "Facilitate quicker and more efficient website development by offering reusable components and standardized design patterns."
      ],
      "background": "In response to the urgent need to build a functional and consistent website during the COVID-19 lockdown, the Ministry of Education recognized the necessity for a robust design system. The design system was conceived to streamline future development efforts and enhance the overall user experience across digital touchpoints.",
      "designProcess": {
        "research": "Conducted a comprehensive analysis of existing design systems and component libraries. Reviewed feedback from the rapid website development project to identify pain points and areas for improvement.",
        "definingProblem": "The lack of a standardised design framework led to inconsistencies and inefficiencies in the rapid development of the website. The primary challenge was to create a design system that addressed these issues while meeting accessibility requirements.",
        "ideation": "Developed initial concepts for the design system, including core components, design patterns, and guidelines. Engaged with stakeholders to gather input on essential features and requirements.",
        "prototyping": "Created prototypes of key components and design patterns using tools like Figma. Tested prototypes with internal teams to validate functionality and gather feedback.",
        "feedback": "Incorporated feedback from designers, developers, and accessibility experts. Adjusted the design system based on usability testing and stakeholder input to ensure it met diverse needs and standards.",
        "designProcessImages":[
            {
            "path": "/images/optional/design-system-process-1.png"
            },
            {
              "path": "/images/optional/design-system-process-2.png"
            }
        ]
      },
      "solutionImplementation": {
        "designDecisions": "Focused on creating a design system that emphasised consistency, accessibility, and ease of use. Prioritised the development of reusable components that could be easily customised.",
        "accessibilityUsability": "Ensured compliance with WCAG 2.1 guidelines to make the design system inclusive. Included features like keyboard navigation and screen reader support in component designs.",
        "challengesFaced": "Encountered challenges in ensuring the design system met all accessibility standards and was adaptable to various use cases. Addressed these by incorporating detailed guidelines and extensive testing.",
        "designProductImages":[
          "/images/product/design-system-product-1.png",
          "/images/product/design-system-product-2.png",
          "/images/product/design-system-product-3.png"

        ]
      },
      "lessonsLearned": {
        "designInsights": "Learned the importance of creating a design system that balances flexibility with consistency. Discovered that clear documentation and thorough testing are critical for successful implementation.",
        "technicalInsights": "Gained experience in integrating a design system with existing digital platforms and managing version control for a shared component library. Improved skills in developing accessible and reusable components.",
        "improvements": "Future iterations of the design system could benefit from enhanced documentation, more detailed usage examples, and expanded support for additional design patterns and components. Also planned to include case studies, to show how the design system could be utilised, and highlighting why design systems are so useful for cross-collaborative teams."
      },
      "keyTakeaways": {
        "summary": "The Ministry of Education Design System successfully provided a standardised approach to design and development, improving consistency and efficiency in digital projects. It highlighted the value of having a comprehensive design system to support future needs.",
        "demonstrationSkills": "Demonstrated skills in UX/UI design, component library creation, accessibility compliance, and technical leadership. Showcased ability to develop and implement a design system from conception to deployment."
      }
    },

  {
      "id": 4,
      "projectImage": "/images/portfolio/NCEA - HERO.png",
      "headerImage": "/images/banner-images/moe-ncea.png",
      "projectTitle": "Ministry of Education - NCEA Website",
      "slug": "moe-ncea-website",
      "company": "Ministry of Education (New Zealand)",
      "role": "Senior UX/UI Designer",
      "date": "2019 - 2021",
      "overview": "The NCEA Website project aimed to provide teachers with a centralised platform to access information on new assessment standards, subject materials, and updates on the change programme. The project involved designing a user-friendly interface that simplifies navigation and enhances access to crucial educational resources.",
      "objectiveGoals": [
        "Create an intuitive platform for teachers to access up-to-date information on NCEA assessment standards and subject materials.",
        "Improve the user experience by offering streamlined navigation and easy access to essential resources.",
        "Ensure that the platform supports educators in understanding and implementing changes in the NCEA assessment programme.",
        "Incorporate feedback from educators to continuously refine and enhance the website's functionality and content."
      ],
      "background": "The NCEA Website was developed in response to the NCEA Change Programme, which kicked off in 2019. This was the first step to digitise and create a single touch point for teachers to access the newly updated assessment standards, newly introduced subjects and materials.",
      "designProcess": {
        "research": "Conducted user research through interviews and surveys with teachers to understand their needs and pain points. Most of the insights were received though the change programme workstreams itself, as the advisors worked closely with the teachers. Analysed existing systems and best practices for educational websites.",
        "definingProblem": "Identified key problems including fragmented information, difficult navigation, and outdated content. Defined the need for a unified platform to streamline access to NCEA resources. This was often done by reviewing proposed changes to the ncea programme, in form of a workshop with the advisors.",
        "ideation": "Brainstormed design solutions that included user-friendly navigation, clear categorisation of resources, and a responsive design. Created wireframes and user flows to visualise the proposed solution.",
        "prototyping": "Developed interactive prototypes using tools like Adobe XD. Conducted usability testing with teachers to gather feedback and refine the design.",
        "feedback": "Collected feedback from initial user testing and stakeholder reviews. Incorporated suggestions to improve the usability and effectiveness of the design. Because the designs were worked on in parallel to the change programme itself, stakeholders and teachers who worked at the Ministry provided regular feedback. Regular consulation periods were held with NCEA teachers who worked at New Zealand schools.",
        "designProcessImages":[
          {
            "path": "/images/optional/ncea-process-1.png"
          }
        ]
      },
      "solutionImplementation": {
        "designDecisions": "Focused on creating a clean and intuitive interface to facilitate easy access to information. Prioritised responsive design to ensure accessibility across devices.",
        "accessibilityUsability": "Ensured compliance with WCAG 2.1 guidelines to make the website accessible to all users. Included features such as keyboard navigation and screen reader support.",
        "challengesFaced": "Faced challenges in the design process overall, as it was Waterfall based, and often the designs proceeded the content production, which created blue-sky scenarios. The user consulations were not consistent, so we had stages where we had no validation around whether the designs meet the users needs. Incorporating different cultural world views was tricky, as we had limited access to certain demographic groups.",
        "designProductImages":[
          "/images/product/ncea-product-1.png",
          "/images/product/ncea-product-2.png",
          "/images/product/ncea-product-6.png",
          "/images/product/ncea-product-4.png",
          "/images/product/ncea-product-5.png"
        ]
      },
      "lessonsLearned": {
        "designInsights": "Learned the importance of designing for diverse user needs and incorporating feedback early in the design process. Discovered the value of a modular design for future scalability.",
        "improvements": "Future iterations could include more interactive features and enhanced personalisation options for users. Continued user feedback will be crucial for ongoing improvements."
      },
      "keyTakeaways": {
        "summary": "The NCEA Website project successfully delivered a centralised platform for teachers, improving access to crucial educational resources and streamlining navigation. The project highlighted the importance of user-centered design and effective integration of educational content.",
        "demonstrationSkills": "Showcased skills in UX/UI design, technical leadership, and user testing. Demonstrated ability to deliver a high-quality, scalable solution for educational needs. This project allowed me to grow from an intermediate designer into a Senior UX/UI Designer by taking on more responsibility."
      }
    },
    {
      "id": 5,
      "projectImage": "/images/portfolio/grow-grub.png",
      "headerImage": "/images/banner-images/grow-grub.png",
      "projectTitle": "Grow-Grub",
      "slug": "grow-grub",
      "company": "Dev Academy",
      "role": "Full Stack Developer (Student), UX/UI Designer",
      "date": "June - July 2024",
      "overview": "Grow-Grub is a comprehensive app designed to help gardening enthusiasts in New Zealand effortlessly plan, track, and manage their vegetable gardens, catering to both beginners and seasoned gardeners.",
      "objectiveGoals": [
        "Simplify garden management by integrating planning, tracking, and care into a single platform.",
        "Enhance gardening success rates with features such as automated care reminders and progress tracking.",
        "Provide a user-friendly experience tailored to both novice and experienced gardeners.",
        "Offer personalised advice and seasonal tips to help users make informed gardening decisions."
      ],
      "background": "The concept for Grow-Grub originated from our team's shared passion for vegetable gardening and caring for plants. Recognising the challenges gardeners face, we developed the app to streamline garden planning, tracking, and management. Our goal was to cater to the increasing number of people interested in sustainable living and home gardening. Unlike most garden design tools, which are often proprietary, we aimed to create an open-source platform to make garden planning accessible and customisable for everyone.",
      "backgroundImages": [
        "/images/optional/grow-grub-background.png"],
      "designProcess": {
        "research": "We conducted market research to understand the needs and preferences of vegetable gardeners. Analysed existing solutions to identify gaps and opportunities.",
        "definingProblem": "Existing resources are often overwhelming or insufficiently tailored to the specific needs and preferences of veggie gardeners, leading to uncertainty about plant selection, layout, planting schedules, and maintenance practices. They are either catering to beginner gardeners, or to fully experienced users. A solution is needed that simplifies planning and maintenance of the garden, providing a planning tool and reminders to ensure the plants thrive and produce a successful harvest, but still acknowledges the gardeners proficiency level.",
        "ideation": "Developed user personas that focused on different gardening proficiencies and interests, user journey with important tech stack points and prioritised features based on research findings and MVP scope. Focused on functionalities like garden planning, plant tracking, care reminders, and plant information.",
        "prototyping": "Created low-fidelity wireframes as a team, to facilitate buy-in by the whole team and feasibility check. Then I went and created high-fidelity wireframes, to ensure we have a cohesive user experience and a plan for how the user interface looks.",
        "designProcessImages": [
          {
            "path": "/images/optional/grow-grub-user-profiles.png"
            },
            {
              "path": "/images/optional/grow-grub-user-tech-journey.png",
              "caption": "A MVP user journey map, with tech dependency points - this was used to highlight the screens that we needed to build, what types of inteactions needed to be considered for them, and what data was going to be requested from the database. This was especially important as we had to determine what type of information the user would see for each screen, parts of this was send by an API and the rest from our own database."
            }
        ]
      },
      "softwareDevelopment": {
        "techStack": "We tried to use most of the technologies that have been introduced to us during the bootcamp. Used React for cross-platform development, Gemini API to access plant data, and storig data with SQLite3 (with Knex) for backend services. For the Garden layout tool, we used the 'React-Grid-Layout' npm package. We used Tailwind CSS to keep the components and styling consistent throughout the product, the front-end was built predominantely with React and TypeScript. We used Auth0 to authenticate the user with a register page and login functionality.",
        "architecture": "Implemented a modular architecture with a clear separation between frontend and backend components. Ensured scalability and maintainability of the app.",
        "developmentProcess": "Followed an agile development process with regular sprints and iterative merges. Employed continuous integration and deployment practices to ensure timely updates. We sliced the features vertically (front & back end) and horizontally (front-end only or back-end only) depending on the feature that needed to be priotised. We worked on features in pairs or solo.",
        "integration": "Integrated frontend and backend systems, ensuring seamless synchronisation of data and smooth user experience across different devices. Connected an external API (Gemini) with a SQLite based database, which contains additional plant data, saved garden layout data and user data."
      },
      "solutionImplementation": {
        "designDecisions": "Focused on creating a clean, intuitive interface with a natural color scheme to enhance user engagement. Incorporated and prioritised features that simplify planning and maintancence of gardens, over decorative nice to have featurss. Using Tailwind CSS framework ensure the brand and UI design was implemented cohesively.",
        "codingProcesses": "Employed best practices in coding, including modular development, and code reviews. We regularly pair programmed, and we made sure we got everyone on features that aligned with their learning objectives. Regular check-ins of the whole team to determine any blockers or possible dependencies on other workstreams.",
        "deployment": "Originally deployed the app to a Dev Academy's Dokku host - however this was a short-term solution and we need to explore an alternative where we can host the app longer.",
        "challengesFaced": "Faced challenges related to integrating various features seamlessly and optimizing the app for different devices and operating systems. We had a large team, so we had to carefully plan out 2-3 workstreams ad overall areas that everyone worked on simutanously. Due to my UX design background, I decided to take ownership of the front-end, as I knew the wireframes very well and I wanted to learn how to use the Tailwind CSS framework and implement React's use methods in different ways. But this also meant that I was a bit further removed from the back-end as anticipated, and this caused miscommunication to some parts that we wanted to display visually e.g. we had a few missing vegetable icons and plant care instructions, because I wasn't aware we got this data from Gemini.",
        "designProductImages":[
          "/images/product/grow-grub-hi-fi-wireframes 1.png",
          "/images/product/grow-grub-hi-fi-wireframes 2.png"
        ]
      },
      "lessonsLearned": {
        "designInsights": "Most of the peers in my team never worked with a designer before, so I had to take extra care in explaining decisions and design patterns carefully. At the end of the project, they did give me the feedback that this helped them immensely for envisioning what the product would look like. It created a sense of certainty and agreement of what we were going to build together. I was very aware of keeping the design incredibly simple, mainly because of the tech spikes we had to explore (e.g. Gemini API and React Grid) in a very short time frame, and all of us code at different speeds. As a designer, I would have fleshed it out a little more if I had a bit more time for the design process.",
        "technicalInsights": "Gained in-depth knowledge about front-end development. I always spread myself across full- in our grou projects at the course, but I wanted to ensure that I started gaining deeper knowledge in React, which to this point I felt just scraped the surface. Instead of Gemini, we originally wanted to implement Perenual API, but ran into a pay wall and therefore had to switch direction.",
        "improvements": "We didn't get around to implement any tests (test-driven development) and test our wireframes with any of our peers, which would have been something we would have to plan into our process to begin with. Additionally, we had team members who go quite excited about the project, which caused them to get carried away and added more features even though we were already stretching the MVP to it's limit. Being adaptive is good, but some of those add-ons were done without the buy-in by the entire team. This caused some pressure on other workstreams, as additional dependencies were created, and also meant that we lost a bit of oversight on what the final product would contain in terms of functionality. Auth0 needs to be setup so that anyone can login/register, including a fleshed out user journey and screens for this part of the product."
      },
      "keyTakeaways": {
        "summary": "We managed to create an MVP of Grow-Grub, which successfully addressed the need planning, tracking tasks and showing important plant data for several different fruits and vegetables. The functionality of the MVP would be enough for a testing prototype, with future enhancements in the backlog.",
        "demonstrationSkills": "Demonstrated skills in user-centered design, cross-platform development, and agile project management. Worked in pair and solo programming sessions, led couragous conversations by positively challenging the team of making smart product decisions, particularly in the planning stage of the product."
      },
      "finalImage": "/images/optional/grow-grub-hi-fi-wireframes.png",
      "githubLink": "https://github.com/corina-reitemeyer/Grow-Grub"
    }
  ]